# <font color=lightblue>Pandas II - Aplicações na Vida Real </font>

# <font color=lightblue>Sumário</font>

- ### <font color=lightpink>1. Introdução </font>
        
        1.1 Apresentação das bases de dados
        1.2 Loc e iloc

- ### <font color=lightpink>2. Métodos Úteis </font>
        
        2.1 Agrupamento
        2.1.1 Groupby
        2.1.2 Pivot Table
        2.1.3 Melt
        
        2.2.1 Diff
        2.2.2 Pct_change

- ### <font color=lightpink>3. Aplicações Úteis </font>

        3.1 Cálculo de retorno
        3.2 Melhores retornos para cada fundos
        3.3 Juntando os Resultados

In [2]:

pip install pandas

Requirement already satisfied: pandas in c:\users\lucfe\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lucfe\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\lucfe\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\lucfe\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\lucfe\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (1.25.0)
Requirement already satisfied: six>=1.5 in c:\users\lucfe\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 23.1.2
[notice] To update, run: C:\Users\lucfe\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

## 1. Introdução

### 1.1 Apresentação da base de dados "Latest_Data_Science_Salaries.csv"

##### O método info() é usado para obter informações sobre o DataFrame, como o número de entradas, o tipo de dados de cada coluna, o uso de memória, entre outros detalhes.

In [71]:
salaries = pd.read_csv("Latest_Data_Science_Salaries.csv")
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3300 entries, 0 to 3299
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Job Title           3300 non-null   object
 1   Employment Type     3300 non-null   object
 2   Experience Level    3300 non-null   object
 3   Expertise Level     3300 non-null   object
 4   Salary              3300 non-null   int64
 5   Salary Currency     3300 non-null   object
 6   Company Location    3300 non-null   object
 7   Salary in USD       3300 non-null   int64
 8   Employee Residence  3300 non-null   object
 9   Company Size        3300 non-null   object
 10  Year                3300 non-null   int64
dtypes: int64(3), object(8)
memory usage: 283.7+ KB

##### O método describe() é usado para gerar estatísticas descritivas sobre o DataFrame, como contagem, média, desvio padrão, mínimo, quartis e máximo. Ele fornece um resumo estatístico das colunas numéricas do DataFrame.

In [11]:
salaries = pd.read_csv("Latest_Data_Science_Salaries.csv")
salaries.describe()

             Salary  Salary in USD         Year
count  3.300000e+03    3300.000000  3300.000000
mean   2.046623e+05  142095.983939  2022.495455
std    7.279383e+05   69028.235512     0.716355
min    1.400000e+04   15000.000000  2020.000000
25%    9.416900e+04   90000.000000  2022.000000
50%    1.400000e+05  136000.000000  2023.000000
75%    1.900000e+05  185000.000000  2023.000000
max    3.040000e+07  450000.000000  2023.000000

##### O método head() é usado para exibir as primeiras linhas do DataFrame. Por padrão, ele exibe as 5 primeiras linhas.

In [12]:
salaries = pd.read_csv("Latest_Data_Science_Salaries.csv")
salaries.head()

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year
0,Data Engineer,Full-Time,Senior,Expert,210000,United States Dollar,United States,210000,United States,Medium,2023
1,Data Engineer,Full-Time,Senior,Expert,165000,United States Dollar,United States,165000,United States,Medium,2023
2,Data Engineer,Full-Time,Senior,Expert,185900,United States Dollar,United States,185900,United States,Medium,2023
3,Data Engineer,Full-Time,Senior,Expert,129300,United States Dollar,United States,129300,United States,Medium,2023
4,Data Scientist,Full-Time,Senior,Expert,140000,United States Dollar,United States,140000,United States,Medium,2023

### Loc e iloc

In [73]:
salaries = pd.read_csv("Latest_Data_Science_Salaries.csv")

##### O '.loc' é útil quando você deseja realizar operações no DataFrame usando rótulos de linhas e colunas, em vez de índices numéricos. Ele oferece uma maneira mais intuitiva e explícita de acessar e modificar os dados.

In [118]:
#Acessar uma única linha com base no rótulo da linha:
salaries.loc[4]

Job Title                   Data Scientist
Employment Type                  Full-Time
Experience Level                    Senior
Expertise Level                     Expert
Salary                              140000
Salary Currency       United States Dollar
Company Location             United States
Salary in USD                       140000
Employee Residence           United States
Company Size                        Medium
Year                                  2023
Name: 4, dtype: object

In [119]:
#Acessar uma única coluna com base no rótulo da coluna:
salaries.loc[:, "Job Title"]

0                  Data Engineer
1                  Data Engineer
2                  Data Engineer
3                  Data Engineer
4                 Data Scientist
                  ...
3295              Data Scientist
3296    Principal Data Scientist
3297              Data Scientist
3298       Business Data Analyst
3299        Data Science Manager
Name: Job Title, Length: 3300, dtype: object

In [120]:
#Acessar mais de uma linha com base no rótulo das linhas:
salaries.loc[2:5]

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year
2,Data Engineer,Full-Time,Senior,Expert,185900,United States Dollar,United States,185900,United States,Medium,2023
3,Data Engineer,Full-Time,Senior,Expert,129300,United States Dollar,United States,129300,United States,Medium,2023
4,Data Scientist,Full-Time,Senior,Expert,140000,United States Dollar,United States,140000,United States,Medium,2023
5,Data Scientist,Full-Time,Senior,Expert,126000,United States Dollar,United States,126000,United States,Medium,2023

In [125]:
#Acessar mais de uma coluna com base no rótulo das colunas:
salaries.loc[:,["Salary", "Experience Level"]]

       Salary Experience Level
0      210000           Senior
1      165000           Senior
2      185900           Senior
3      129300           Senior
4      140000           Senior
...       ...              ...
3295   412000           Senior
3296   151000              Mid
3297   105000            Entry
3298   100000            Entry
3299  7000000           Senior

[3300 rows x 2 columns]

In [126]:
#Acessar mais de uma linha e coluna com base no rótulo das linhas e das colunas:
salaries.loc[2:5, ["Salary", "Experience Level"]]

   Salary Experience Level
2  185900           Senior
3  129300           Senior
4  140000           Senior
5  126000           Senior

##### O .iloc é um atributo do DataFrame do Pandas que permite acessar e modificar os valores com base em índices numéricos de linhas e colunas. Ao contrário do .loc, que usa rótulos de linhas e colunas, o .iloc é usado para indexação baseada em índices numéricos.

In [127]:
#Acessar uma única linha com base no número da linha:
salaries.iloc[0]

Job Title                    Data Engineer
Employment Type                  Full-Time
Experience Level                    Senior
Expertise Level                     Expert
Salary                              210000
Salary Currency       United States Dollar
Company Location             United States
Salary in USD                       210000
Employee Residence           United States
Company Size                        Medium
Year                                  2023
Name: 0, dtype: object

In [130]:
#Acessar linhas e colunas com base no alcance:
salaries.iloc[range(2), range(1)]

       Job Title
0  Data Engineer
1  Data Engineer

In [131]:
#Acessar mais de uma linha com base no número das linhas:
salaries.iloc[[9, 5, 6]]

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year
9,Data Engineer,Full-Time,Mid,Intermediate,75000,British Pound Sterling,United Kingdom,92280,United Kingdom,Medium,2023
5,Data Scientist,Full-Time,Senior,Expert,126000,United States Dollar,United States,126000,United States,Medium,2023
6,Data Scientist,Full-Time,Senior,Expert,170000,United States Dollar,United States,170000,United States,Medium,2023

In [132]:
##Acessar mais de uma linha e mais de uma coluna com base no número das linhas e das colunas:
salaries.iloc[[5,6,7],[1,2,3]]

  Employment Type Experience Level Expertise Level
5       Full-Time           Senior          Expert
6       Full-Time           Senior          Expert
7       Full-Time           Senior          Expert

### Retorno a apresentação das bases

In [133]:
#Unique é usado para retornar os valores únicos presentes, ou seja, todas as respostas possíveis.
salaries['Experience Level'].unique()

array(['Senior', 'Mid', 'Executive', 'Entry'], dtype=object)

In [137]:
print(len(salaries["Salary"].unique()), "vs", len(salaries.columns))
print(ct["Salary"].unique()[0])

1071 vs 11
210000

#### Set Theory
![set_theory](set_theory.png)
![set_theory_ativos](set_theory_ativos.png)

In [ ]:
# sets https://www.w3schools.com/python/python_ref_set.asp
x = {'Petrobras', 'Itau', 'Suzano'}
y = {'Eletrobras', 'Bradesco', 'Suzano'}

z = x.difference(y)
z

In [ ]:
y.difference(x)

In [ ]:
x.symmetric_difference(y)

In [ ]:
x.intersection(y)

In [ ]:
# acessar colunas do dataframe de ativos
at.columns

In [ ]:
set(at.columns.unique()).difference(ct["ativo"].unique())

In [ ]:
set(ct["ativo"].unique()).difference(at.columns.unique())

In [ ]:
ct.loc[ct["ativo"].isin(at.columns), ["ativo", "ativo_desc"]].drop_duplicates()

In [ ]:
ct.loc[ct["ativo"].isin(at.columns), "ativo_desc"].unique()

In [ ]:
pd.set_option('max_colwidth', None)
ct[["nome_gestor", "nome_fundo"]].drop_duplicates().reset_index(drop=True)

In [ ]:
pd.reset_option('^display.', silent=True)

## 2. Métodos Úteis

### 2.1.1 Groupby

In [ ]:
ct.groupby("nome_fundo").nunique()[["ativo"]]

In [ ]:
ct[["nome_fundo", "data", "ativo"]].groupby(["nome_fundo", "data"]).count()

### 2.1.2 Pivot Table

In [ ]:
ct.pivot_table("ativo_desc", index="nome_fundo", columns="data", aggfunc=lambda x: len(x.unique()))

In [ ]:
ct.pivot_table("ativo", index="nome_fundo", columns="data", aggfunc=lambda x: len(x.unique()))

In [ ]:
pivoted_table = ct.pivot_table("ativo", index="nome_fundo", columns="data", aggfunc="count")
pivoted_table

### 2.1.3 Melt

In [ ]:
pivoted_table.melt(ignore_index=False).head(6)

### 2.2.1 Diff

In [ ]:
np.random.seed(420)
rand_series = np.random.rand(100)
plt.plot(np.arange(100), rand_series)

In [ ]:
x = np.arange(100).reshape(-1, 1)
y_tendencia = (rand_series * np.arange(1, 20, .19)).reshape(-1, 1)
pred = LinearRegression().fit(x, y_tendencia).predict(x)

In [ ]:
fix, ax = plt.subplots()
ax.plot(x, y_tendencia)
ax.plot(pred)
plt.show()

In [ ]:
y = pd.Series(y_tendencia.flatten()).diff()
pred = LinearRegression().fit(x, y.fillna(0)).predict(x)

fig, ax = plt.subplots()
# função plot do pandas
y.diff().plot()
ax.plot(pred)
plt.show()

### 2.2.2 Pct_change

In [ ]:
((at - at.shift(1)) / at).head()

In [ ]:
(at.diff() / at).head()

In [ ]:
at.pct_change().head()

In [ ]:
at.pct_change().iloc[1:]

In [ ]:
filling_first = at.pct_change()

In [ ]:
filling_first.iloc[0] = 0

In [ ]:
filling_first.head()

## 3. Aplicações Úteis

### 3.1 Cálculo de Retorno

In [ ]:
((at.pct_change() + 1).prod() - 1).sort_values(ascending=False)[:5]

In [ ]:
((at.pct_change() + 1).prod() - 1)[:3]

In [ ]:
top_10_geral = ((at.pct_change() + 1).prod() - 1).sort_values(ascending=False)[:10]

### 3.2 Cálculo Para Cada Fundo

In [ ]:
ativos_tarkus = (ct.loc[ct["ativo"].isin(at.columns) &
                        (ct["nome_fundo"]=="KAPITALO TARKUS MÁSTER FUNDO DE INVESTIMENTO EM AÇÕES"),
                        "ativo"]
                   .unique()
)
ativos_t3 = (ct["ativo"][ct["ativo"].isin(at.columns) &
                         (ct["nome_fundo"]=="T3 FUNDO DE INVESTIMENTO MULTIMERCADO CRÉDITO PRIVADO LONG BIASED")]
                   .unique()
)

In [ ]:
top_10_tarkus = ((at[ativos_tarkus].pct_change() + 1).prod() - 1).sort_values(ascending=False)[:10]
top_10_t3 = ((at[ativos_t3].pct_change() + 1).prod() - 1).sort_values(ascending=False)[:10]

### 3.3 Juntando os Resultados

In [ ]:
pd.concat([top_10_geral.rename("Geral"),
           top_10_tarkus.rename("Kapitalo Tarkus"),
           top_10_t3.rename("Tower Three Long Biased")], axis=1)

![](joins.png)

In [ ]:
(pd.DataFrame(top_10_geral.rename("Geral"))
   .merge(top_10_tarkus.rename("Tarkus"),
          left_index=True,
          right_index=True,
          how="outer")
   .merge(top_10_t3.rename("Tower Three Long Biased"),
          left_index=True,
          right_index=True,
          how="outer")
).sort_values("Geral", ascending=False)

In [ ]:
(pd.DataFrame(top_10_geral.rename("Geral"))
   .join(top_10_tarkus.rename("Tarkus"),
          how="outer")
   .join(top_10_t3.rename("Tower Three Long Biased"),
          how="outer")
).sort_values("Geral", ascending=False)